In [1]:
person = {
    "first": ["Hari", "Carey"],
    "last": ["Aineri", "Schafer"],
    "email": ["HariAineri@gmail.com", "CareySchafer@gmail.com"]
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(person)

In [4]:
df

   first     last                   email
0   Hari   Aineri    HariAineri@gmail.com
1  Carey  Schafer  CareySchafer@gmail.com

In [5]:
df['first'] +  ' ' + df['last']

0      Hari Aineri
1    Carey Schafer
dtype: object

In [6]:
df['full_name'] = df['first'] +  ' ' + df['last']

In [7]:
df

   first     last                   email      full_name
0   Hari   Aineri    HariAineri@gmail.com    Hari Aineri
1  Carey  Schafer  CareySchafer@gmail.com  Carey Schafer

In [8]:
df.drop(columns=['first', 'last'], inplace=True)

In [9]:
df

                    email      full_name
0    HariAineri@gmail.com    Hari Aineri
1  CareySchafer@gmail.com  Carey Schafer

In [10]:
df['full_name'].str.split(' ', expand=True)

       0        1
0   Hari   Aineri
1  Carey  Schafer

In [11]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [12]:
df

                    email      full_name  first     last
0    HariAineri@gmail.com    Hari Aineri   Hari   Aineri
1  CareySchafer@gmail.com  Carey Schafer  Carey  Schafer

In [13]:
df._append({'first': 'abc'}, ignore_index=True)

                    email      full_name  first     last
0    HariAineri@gmail.com    Hari Aineri   Hari   Aineri
1  CareySchafer@gmail.com  Carey Schafer  Carey  Schafer
2                     NaN            NaN    abc      NaN

In [14]:
df

                    email      full_name  first     last
0    HariAineri@gmail.com    Hari Aineri   Hari   Aineri
1  CareySchafer@gmail.com  Carey Schafer  Carey  Schafer

In [15]:
people = {
    "first": ["Tony", "Steve"],
    "last": ["Stark", "Rogers"],
    "email": ["IronMan@avenge.com", "Cap@avenge.com"]
}

In [16]:
df2 = pd.DataFrame(people)

In [17]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [18]:
df = df._append(df2, ignore_index=True)

In [19]:
df

                    email      full_name  first     last
0    HariAineri@gmail.com    Hari Aineri   Hari   Aineri
1  CareySchafer@gmail.com  Carey Schafer  Carey  Schafer
2      IronMan@avenge.com            NaN   Tony    Stark
3          Cap@avenge.com            NaN  Steve   Rogers

In [20]:
df.drop(index=3)

                    email      full_name  first     last
0    HariAineri@gmail.com    Hari Aineri   Hari   Aineri
1  CareySchafer@gmail.com  Carey Schafer  Carey  Schafer
2      IronMan@avenge.com            NaN   Tony    Stark

In [21]:
df

                    email      full_name  first     last
0    HariAineri@gmail.com    Hari Aineri   Hari   Aineri
1  CareySchafer@gmail.com  Carey Schafer  Carey  Schafer
2      IronMan@avenge.com            NaN   Tony    Stark
3          Cap@avenge.com            NaN  Steve   Rogers

In [22]:
filt = (df['last'] == 'Rogers')
df.drop(index=df[filt].index)

                    email      full_name  first     last
0    HariAineri@gmail.com    Hari Aineri   Hari   Aineri
1  CareySchafer@gmail.com  Carey Schafer  Carey  Schafer
2      IronMan@avenge.com            NaN   Tony    Stark